2022-03-07-a-little-transparency.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-03-23 Wed 21:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>A little transparency</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="static/style.css" />
</head>
<body>
<div id="preamble" class="status">
<div class="header">
    <a href="index.html">Home</a>
    <a href="https://github.com/c3lphie">Github</a>
</div>
</div>
<div id="content">
<header>
<h1 class="title">A little transparency</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org69f8bca">1. TL;DR</a></li>
<li><a href="#org88423ca">2. Motivation</a></li>
<li><a href="#org448f69b">3. Being Offline</a></li>
<li><a href="#orgf21832f">4. Give me all your money!!!!! (jk)</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org69f8bca" class="outline-2">
<h2 id="org69f8bca"><span class="section-number-2">1</span> TL;DR</h2>
<div class="outline-text-2" id="text-1">
<p>
I've realised that doing this just for me, isn't enough motivation to keep doing it.<br>
Been busy with offline stuff.<br>
Added a donation page (only taking crypto).<br>
</p>
</div>
</div>

<div id="outline-container-org88423ca" class="outline-2">
<h2 id="org88423ca"><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-2">
<p>
When I first started this blog, it was with the purpose having a place to share write-ups from CTF's HackTheBox or other things I find interesting.<br>
Just a place where I could store information, which others might stumble upon and like.<br>
</p>

<p>
Wanting to do something just for me, as a learning resource for myself.<br>
Means that all the responsibility for making the posts, write-ups or what-ever is on me and with a targeted audience that is&#x2026; you guessed it: ME.<br>
</p>

<p>
Idk about you(whoever reads this), but I'm not the best at sticking to working on projects that is only for me.<br>
I need some kind of external pressure/motivation to keep doing it.<br>
Which kinda goes against the reason I created this blog in the first place, but I really do enjoy writing posts and write-ups.<br>
I just lack motivation, and I wanted to change this.<br>
</p>
</div>
</div>

<div id="outline-container-org448f69b" class="outline-2">
<h2 id="org448f69b"><span class="section-number-2">3</span> Being Offline</h2>
<div class="outline-text-2" id="text-3">
<p>
Other than not having motivation to just write posts and whatever, I have been busy with my offline life.<br>
</p>

<p>
Exams are over(thank god), and after having a small vacation where I could forget about everything that wasn't important was nice.<br>
In the beginning of the year I set myself a challenge of completing 1 HackTheBox machine each week of 2022, but life happened and never managed to find time each week to dedicate to doing that.<br>
</p>

<p>
So that have been a bit of a bummer, but not something worth losing sleep over.<br>
</p>
</div>
</div>

<div id="outline-container-orgf21832f" class="outline-2">
<h2 id="orgf21832f"><span class="section-number-2">4</span> Give me all your money!!!!! (jk)</h2>
<div class="outline-text-2" id="text-4">
<p>
I order to address my lack of motivation, I figured why not accept money!<br>
The best motivation for anything in our capitalistic world.<br>
</p>

<p>
As i currently see it there are 2 options:<br>
</p>
<ol class="org-ol">
<li>Serve ads and basically sell YOUR data to google or whatever other ad agency that I would end up using<br></li>
<li>Take donations<br></li>
</ol>

<p>
As you might be able to read between the lines in the above list, I'm not a fan of ads.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup><br>
In fact I promise to never serve ads, or track what you're doing using some proprietary solution that might sell your data unbeknownst to both me and you.<br>
</p>

<p>
I run no tracking on this site.<br>
</p>

<p>
That is a good thing regarding privacy, but that also means I have no idea if people visit my site or anything like that.<br>
Which kinda sucks to be honest, as we all like to numbers increase like some cookie clicker game.<br>
</p>

<p>
I have thought about implementing some type of tracking just to get basic statistics like how many visitors I have, and maybe geographic information(IP based), but I want it to be done properly and with respect for you (will also make a post like this to inform you).<br>
</p>

<p>
So I have decided to take donations, and again with respect to privacy, I only take crypto.<br>
</p>

<p>
Only donate if it is within your budget!<br>
There is no reason to go broke for some random dude on the internet.<br>
Wallet addresses can be found <a href="https://c3lphie.com/donate.html">HERE</a>, or on the link on my homepage.<br>
</p>

<p>
If you happen to use the brave browser I have added myself as a creator, so you can support me through that aswell. (THIS IS NOT AN AD FOR BRAVE, use whatever browser you feel comfortable in)<br>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<b>Note:</b> I get the function of ads, and see their meaning and use on the online world, I just don't agree with the way it is done 99% of the time.<br>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<div class="footer">
    <div id="copyright">
        <small>&copy; Copyright 2021, C3lphie</small>
    </div>
</div>
</div>
</body>
</html>
